{
    "pt": {
        "homeButton": "Início",
        "specialtiesButton": "Especialidades",
        "aboutButton": "Sobre",
        "projectButton": "Projetos",
        "contactButton": "Contacto",
        "topSiteTitle": "TRANSFORMAR IDEIAS EM REALIDADE DIGITAL<span>.</span>",
        "topSiteText": "Criatividade e inovação andam lado a lado. Com uma combinação única de design impactante, funcionalidade intuitiva e otimização para resultados, estou pronto para criar a presença online dos seus sonhos.",
        "downloadCvButton": "Download meu CV",
        "specialtiesTitle": "MINHAS <span>ESPECIALIDADES.</span>",
        "webDesignTitle": "Website",
        "webDesignText": "Atualmente desenvolvo websites com foco e propósito principal, como: informação, vendas, portfolio, entre outros, aplicando habilidades em diversas linguagens e tecnologias, para criar uma experiência de usuário otimizada e visualmente atrativa, com ênfase na usabilidade e acessibilidade.",
        "programmingLanguagesTitle": "Linguagem de Programação",
        "programmingLanguagesText": "As principais linguagens de desenvolvimento web incluem HTML, CSS e JavaScript para estrutura e interatividade; PHP e Laravel para o back-end; React e Node.js para interfaces e servidores; além de SQL e MongoDB para dados, e SCSS para estilizações avançadas.",
        "teamWorkTitle": "Team Work",
        "teamWorkText": "Tenho ampla experiência em trabalho em equipa, valorizando a colaboração e a comunicação para alcançar objetivos comuns. Ao longo da minha trajetória, aprendi a ouvir, a contribuir com ideias e a adaptar-me a diferentes estilos de trabalho, sempre visando resultados eficientes e harmoniosos.",
        "aboutMeTitle": "MUITO PRAZER, <span>MEU NOME É TIAGO GAGO.</span>",
        "aboutMeText1": "Sou um apaixonado por tecnologia, sou um profissional em Full Stack Developer Website em Lisboa, Portugal 🌍. Estou aqui para ajudar a transformar ideias em soluções poderosas e baseadas em tecnologia!",
        "aboutMeText2": "Sou um developer de websites Junior Full Stack e adoro trabalhar em projetos front-end e back-end. O meu foco é tornar o desenvolvimento suave e escalável, seja construindo uma aplicação web elegante, automatizando fluxos de trabalho ou criando soluções eficientes de base de dados e criação de páginas web. Estou sempre à procura de novas tecnologias que possam agilizar o trabalho e facilitar a vida.",
        "portfolioTitle": "MEU <span>PORTFOLIO.</span>",
        "projeto1": "Adventure",
        "paginaSapo": "Página da Sapo",
        "projeto2": "Portfolio",
        "contactTitle": "FALA <span>COMIGO.</span>",
        "nome": "Seu nome completo:",
        "email": "Seu e-mail:",
        "telefone": "Seu telemóvel:",
        "mensagem": "Mensagem",
        "textoMensagem": "Olá, gostaria de saber mais sobre o seu trabalho, podemos marcar uma entrevista?",
        "enviar": "ENVIAR",
        "linkText": "©Footer Content Including Social Media Icons/Links - <span>Clica aqui para o topo</span>"
    },
    "en": {
        "homeButton": "Home",
        "specialtiesButton": "Specialties",
        "aboutButton": "About",
        "projectButton": "Project",
        "contactButton": "Contact",
        "topSiteTitle": "TURN IDEAS INTO DIGITAL REALITY<span>.</span>",
        "topSiteText": "Creativity and innovation go hand in hand. With a unique combination of impactful design, intuitive functionality, and optimization for results, I am ready to create the online presence of your dreams.",
        "downloadCvButton": "Download My CV",
        "specialtiesTitle": "MY <span>SPECIALTIES.</span>",
        "webDesignTitle": "Website",
        "webDesignText": "I currently develop websites with a main focus and purpose, such as: information, sales, portfolio, among others, applying skills in various languages and technologies, to create an optimized and visually attractive user experience, with an emphasis on usability and accessibility.",
        "programmingLanguagesTitle": "Programming Languages",
        "programmingLanguagesText": "The main web development languages include HTML, CSS, and JavaScript for structure and interactivity; PHP and Laravel for the back-end; React and Node.js for interfaces and servers; as well as SQL and MongoDB for data, and SCSS for advanced styling.",
        "teamWorkTitle": "Team Work",
        "teamWorkText": "I have extensive experience in teamwork, valuing collaboration and communication to achieve common goals. Throughout my journey, I have learned to listen, contribute ideas, and adapt to different work styles, always aiming for efficient and harmonious results.",
        "aboutMeTitle": "NICE TO MEET YOU, <span>MY NAME IS TIAGO GAGO.</span>",
        "aboutMeText1": "I am a technology enthusiast, a Full Stack Developer Website professional in Lisbon, Portugal 🌍. I'm here to help turn ideas into powerful, technology-based solutions!",
        "aboutMeText2": "I am a Junior Full Stack website developer and love working on both front-end and back-end projects. My focus is to make development smooth and scalable, whether building an elegant web application, automating workflows, or creating efficient database solutions and web page creation. I am always looking for new technologies that can streamline work and make life easier.",
        "portfolioTitle": "MY <span>PORTFOLIO.</span>",
        "projeto1": "Adventure",
        "paginaSapo": "Frog Page",
        "projeto2": "Portfolio",
        "contactTitle": "TALK <span>TO ME.</span>",
        "nome": "Your full name:",
        "email": "Your email:",
        "telefone": "Your phone number:",
        "mensagem": "Message",
        "textoMensagem": "Hello, I would like to know more about your work, could we arrange an interview?",
        "enviar": "TO SEND",
        "linkText": "©Footer Content Including Social Media Icons/Links - <span>Click here for top</span>"
    }
}
